<a href="https://colab.research.google.com/github/omullaboyev/data-science/blob/main/2_1_13_Pandas_Arithmetic_Operations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Data Science va Sun'iy Intellekt Praktikum

Ma'lumotlar Tahlili. Pandas kutubxonasi

2.1 Pandas kutubxonasi bilan ishlash.

**2.1.13 Arifmetic amallar**

In [2]:
import pandas as pd
import numpy as np

In [3]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ["a", "c", "e", "f", "g"])

In [4]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [5]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

#`+` - qo'shish

#Series obyektlarini qo'shish

Series obyektlari ustida bajarilgan arifmetik amallar **bir xil** qatorlar indeksi bo'yicha bajariladi.

In [6]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

**Agar bittasida bor indeks ikkinchisida yo'q boi'lsa - natija NaN bo'ladi.**

#DataFrame obyektlarini qo'shish

DataFrame obyektlari ustida bajarilgan arifmetik amallar **bir xil** qator va ustunlar bo'yicha bajariladi.

In [7]:
df1 = pd.DataFrame(np.arange(9.).reshape(3, 3), columns = list("bcd"), index = ["Olma", "Anor", "Uzum"])
df2 = pd.DataFrame(np.arange(12.).reshape(4, 3), columns = list("abc"), index = ["Olma", "Anor", "Qovun", "Anjir"])

In [8]:
df1

        b    c    d
Olma  0.0  1.0  2.0
Anor  3.0  4.0  5.0
Uzum  6.0  7.0  8.0

In [9]:
df2

         a     b     c
Olma   0.0   1.0   2.0
Anor   3.0   4.0   5.0
Qovun  6.0   7.0   8.0
Anjir  9.0  10.0  11.0

In [10]:
df1 + df2

        a    b    c   d
Anjir NaN  NaN  NaN NaN
Anor  NaN  7.0  9.0 NaN
Olma  NaN  1.0  3.0 NaN
Qovun NaN  NaN  NaN NaN
Uzum  NaN  NaN  NaN NaN

**Agar bittasida bor qator\ustun indeksi ikkinchisida bo'lmasa - natija NaN bo'ladi**

#`add` metodi. `+` ning o'rniga ishlatsa bo'ladi.

In [11]:
df1.add(df2)

        a    b    c   d
Anjir NaN  NaN  NaN NaN
Anor  NaN  7.0  9.0 NaN
Olma  NaN  1.0  3.0 NaN
Qovun NaN  NaN  NaN NaN
Uzum  NaN  NaN  NaN NaN

#fill_value - agar DataFrame larning birida ikkinchisida bor qator yoki ustun bo'lmasa qo'shishdan oldin o'rniga berilgan qiymatni qo'yib, keyin qo'shadi. Ikkalasida ham qiymat bo'lmagan kataklar NaN bo'yicha qoladi.

In [13]:
df1.add(df2, fill_value = 0) # df1 ga df2 ni qo'shadi. Agar biron bir DataFrame da kerakli ustun\qator bo'lmasa o'rniga 0 qo'yib keyin qo'shadi. Ikkalasida ham qiymat bo'lmagan kataklar NaN bo'yicha qoladi.

         a     b     c    d
Anjir  9.0  10.0  11.0  NaN
Anor   3.0   7.0   9.0  5.0
Olma   0.0   1.0   3.0  2.0
Qovun  6.0   7.0   8.0  NaN
Uzum   NaN   6.0   7.0  8.0

#`sub` metodi. Ayirish.

In [14]:
df2.sub(df1) # df2 dan df1 ni ayiramiz.

        a    b    c   d
Anjir NaN  NaN  NaN NaN
Anor  NaN  1.0  1.0 NaN
Olma  NaN  1.0  1.0 NaN
Qovun NaN  NaN  NaN NaN
Uzum  NaN  NaN  NaN NaN

In [15]:
df2.sub(df1, fill_value = 0) # df2 dan df1 ni ayiramiz. Agar biron bir DataFrame da kerakli ustun\qator bo'lmasa o'rniga 0 qo'yib keyin ayiradi.

         a     b     c    d
Anjir  9.0  10.0  11.0  NaN
Anor   3.0   1.0   1.0 -5.0
Olma   0.0   1.0   1.0 -2.0
Qovun  6.0   7.0   8.0  NaN
Uzum   NaN  -6.0  -7.0 -8.0

#`-` bu ham ayirish. Lekin - da bo'sh joylarni to'ldirib bo'lmaydi.

In [16]:
df2 - df1

        a    b    c   d
Anjir NaN  NaN  NaN NaN
Anor  NaN  1.0  1.0 NaN
Olma  NaN  1.0  1.0 NaN
Qovun NaN  NaN  NaN NaN
Uzum  NaN  NaN  NaN NaN

In [17]:
df1.sub(df2, fill_value = 0) # df1 dan df2 ni ayiramiz. Agar biron bir DataFrame da kerakli ustun\qator bo'lmasa o'rniga 0 qo'yib keyin ayiradi.

         a     b     c    d
Anjir -9.0 -10.0 -11.0  NaN
Anor  -3.0  -1.0  -1.0  5.0
Olma   0.0  -1.0  -1.0  2.0
Qovun -6.0  -7.0  -8.0  NaN
Uzum   NaN   6.0   7.0  8.0

#`rsub` - o'rnini almashtirib ayirish.

In [18]:
df2.rsub(df1, fill_value = 0) # df1 dan df2 ni ayirish. fill_value = 0 - bo'sh kataklarga avval 0 qo'yish.

         a     b     c    d
Anjir -9.0 -10.0 -11.0  NaN
Anor  -3.0  -1.0  -1.0  5.0
Olma   0.0  -1.0  -1.0  2.0
Qovun -6.0  -7.0  -8.0  NaN
Uzum   NaN   6.0   7.0  8.0

#`div` - Bo'lish

In [19]:
df2.div(df1) # df2 ni df1 ga bo'lish

        a         b     c   d
Anjir NaN       NaN   NaN NaN
Anor  NaN  1.333333  1.25 NaN
Olma  NaN       inf  2.00 NaN
Qovun NaN       NaN   NaN NaN
Uzum  NaN       NaN   NaN NaN

In [21]:
df1.div(df2) # df1 ni df2 ga bo'lish

        a     b    c   d
Anjir NaN   NaN  NaN NaN
Anor  NaN  0.75  0.8 NaN
Olma  NaN  0.00  0.5 NaN
Qovun NaN   NaN  NaN NaN
Uzum  NaN   NaN  NaN NaN

#`rdiv` - o'rnini almashtirib bo'lish

In [22]:
df2.rdiv(df1) # df1 ni df21 ga bo'lish

        a     b    c   d
Anjir NaN   NaN  NaN NaN
Anor  NaN  0.75  0.8 NaN
Olma  NaN  0.00  0.5 NaN
Qovun NaN   NaN  NaN NaN
Uzum  NaN   NaN  NaN NaN

#`DataFrame` va `Series` o'rtasidagi arifmetik amallar

In [26]:
df = pd.DataFrame(np.arange(1, 13.).reshape(3, 4), index = list("abc"), columns = ["Olma", "Anor", "Qovun", "Anjir"])
obj = pd.Series([1, 1, 2, 2], index = df.columns) # obj ning indekslarini df dan oldik

In [27]:
df

   Olma  Anor  Qovun  Anjir
a   1.0   2.0    3.0    4.0
b   5.0   6.0    7.0    8.0
c   9.0  10.0   11.0   12.0

In [28]:
obj

Olma     1
Anor     1
Qovun    2
Anjir    2
dtype: int64

#`+` - qo'shish
DataFrame ning ning har bir qatoridagi elementlarga Seriesning mos elementlari qo'shiladi

In [29]:
df + obj

   Olma  Anor  Qovun  Anjir
a   2.0   3.0    5.0    6.0
b   6.0   7.0    9.0   10.0
c  10.0  11.0   13.0   14.0

Agar Seriesda yoki DataFrame da kerakli element bo'lmasa - natija NaN bo'ladi

In [30]:
obj = pd.Series([2, 3, 1], index = ["Olma", "Uzum", "Qovun"]) # Olma va Qovun indekslari df da ham bor
obj

Olma     2
Uzum     3
Qovun    1
dtype: int64

In [31]:
df - obj # df dan obj ni ayiramiz

   Anjir  Anor  Olma  Qovun  Uzum
a    NaN   NaN  -1.0    2.0   NaN
b    NaN   NaN   3.0    6.0   NaN
c    NaN   NaN   7.0   10.0   NaN

In [32]:
df.sub(obj) # df dan obj ni ayiramiz

   Anjir  Anor  Olma  Qovun  Uzum
a    NaN   NaN  -1.0    2.0   NaN
b    NaN   NaN   3.0    6.0   NaN
c    NaN   NaN   7.0   10.0   NaN

#fill_value bu yerda ishlamaydi.

In [33]:
df

   Olma  Anor  Qovun  Anjir
a   1.0   2.0    3.0    4.0
b   5.0   6.0    7.0    8.0
c   9.0  10.0   11.0   12.0

In [34]:
obj["Olma"]

2

In [35]:
df + obj["Olma"] # df ning har bir elementiga obj ning "Olma" indeksli qiymatini qo'shib chiqamiz

   Olma  Anor  Qovun  Anjir
a   3.0   4.0    5.0    6.0
b   7.0   8.0    9.0   10.0
c  11.0  12.0   13.0   14.0